HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN27 */
#define IFX_CAN_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN27 */
#define IFX_CAN_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN28 */
#define IFX_CAN_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN2 */
#define IFX_CAN_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN2 */
#define IFX_CAN_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN2 */
#define IFX_CAN_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN3 */
#define IFX_CAN_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN3 */
#define IFX_CAN_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN3 */
#define IFX_CAN_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN4 */
#define IFX_CAN_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN4 */
#define IFX_CAN_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN4 */
#define IFX_CAN_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN5 */
#define IFX_CAN_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN5 */
#define IFX_CAN_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN5 */
#define IFX_CAN_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN6 */
#define IFX_CAN_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN6 */
#define IFX_CAN_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN6 */
#define IFX_CAN_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN7 */
#define IFX_CAN_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN7 */
#define IFX_CAN_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN7 */
#define IFX_CAN_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN8 */
#define IFX_CAN_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN8 */
#define IFX_CAN_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN8 */
#define IFX_CAN_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_CAN_ACCEN0_Bits.EN9 */
#define IFX_CAN_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_CAN_ACCEN0_Bits.EN9 */
#define IFX_CAN_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_ACCEN0_Bits.EN9 */
#define IFX_CAN_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_CAN_AWDR_Bits.AWDV */
#define IFX_CAN_AWDR_AWDV_LEN (8)

/** \\brief  Mask for Ifx_CAN_AWDR_Bits.AWDV */
#define IFX_CAN_AWDR_AWDV_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_AWDR_Bits.AWDV */
#define IFX_CAN_AWDR_AWDV_OFF (0)

/** \\brief  Length for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_CAN_CYCTMR_Bits.BCC */
#define IFX_CAN_CYCTMR_BCC_LEN (6)

/** \\brief  Mask for Ifx_CAN_CYCTMR_Bits.BCC */
#define IFX_CAN_CYCTMR_BCC_MSK (0x3f)

/** \\brief  Offset for Ifx_CAN_CYCTMR_Bits.BCC */
#define IFX_CAN_CYCTMR_BCC_OFF (16)

/** \\brief  Length for Ifx_CAN_CYCTMR_Bits.CSM */
#define IFX_CAN_CYCTMR_CSM_LEN (6)

/** \\brief  Mask for Ifx_CAN_CYCTMR_Bits.CSM */
#define IFX_CAN_CYCTMR_CSM_MSK (0x3f)

/** \\brief  Offset for Ifx_CAN_CYCTMR_Bits.CSM */
#define IFX_CAN_CYCTMR_CSM_OFF (24)

/** \\brief  Length for Ifx_CAN_CYCTMR_Bits.CYCTM */
#define IFX_CAN_CYCTMR_CYCTM_LEN (16)

/** \\brief  Mask for Ifx_CAN_CYCTMR_Bits.CYCTM */
#define IFX_CAN_CYCTMR_CYCTM_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_CYCTMR_Bits.CYCTM */
#define IFX_CAN_CYCTMR_CYCTM_OFF (0)

/** \\brief  Length for Ifx_CAN_FDR_Bits.DM */
#define IFX_CAN_FDR_DM_LEN (2)

/** \\brief  Mask for Ifx_CAN_FDR_Bits.DM */
#define IFX_CAN_FDR_DM_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_FDR_Bits.DM */
#define IFX_CAN_FDR_DM_OFF (14)

/** \\brief  Length for Ifx_CAN_FDR_Bits.STEP */
#define IFX_CAN_FDR_STEP_LEN (10)

/** \\brief  Mask for Ifx_CAN_FDR_Bits.STEP */
#define IFX_CAN_FDR_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_CAN_FDR_Bits.STEP */
#define IFX_CAN_FDR_STEP_OFF (0)

/** \\brief  Length for Ifx_CAN_GMR_Bits.GM */
#define IFX_CAN_GMR_GM_LEN (16)

/** \\brief  Mask for Ifx_CAN_GMR_Bits.GM */
#define IFX_CAN_GMR_GM_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_GMR_Bits.GM */
#define IFX_CAN_GMR_GM_OFF (16)

/** \\brief  Length for Ifx_CAN_GMR_Bits.GMFR */
#define IFX_CAN_GMR_GMFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_GMR_Bits.GMFR */
#define IFX_CAN_GMR_GMFR_MSK (0x7f)

