HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Offset for Ifx_CAN_GMR_Bits.GMFR */
#define IFX_CAN_GMR_GMFR_OFF (9)

/** \\brief  Length for Ifx_CAN_ID_Bits.MODNUMBER */
#define IFX_CAN_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_CAN_ID_Bits.MODNUMBER */
#define IFX_CAN_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_ID_Bits.MODNUMBER */
#define IFX_CAN_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_CAN_ID_Bits.MODREV */
#define IFX_CAN_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_CAN_ID_Bits.MODREV */
#define IFX_CAN_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_ID_Bits.MODREV */
#define IFX_CAN_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_CAN_ID_Bits.MODTYPE */
#define IFX_CAN_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_CAN_ID_Bits.MODTYPE */
#define IFX_CAN_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_ID_Bits.MODTYPE */
#define IFX_CAN_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_CAN_KRST0_Bits.RST */
#define IFX_CAN_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_CAN_KRST0_Bits.RST */
#define IFX_CAN_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_KRST0_Bits.RST */
#define IFX_CAN_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_CAN_KRST0_Bits.RSTSTAT */
#define IFX_CAN_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_CAN_KRST0_Bits.RSTSTAT */
#define IFX_CAN_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_KRST0_Bits.RSTSTAT */
#define IFX_CAN_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_CAN_KRST1_Bits.RST */
#define IFX_CAN_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_CAN_KRST1_Bits.RST */
#define IFX_CAN_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_KRST1_Bits.RST */
#define IFX_CAN_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_CAN_KRSTCLR_Bits.CLR */
#define IFX_CAN_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CAN_KRSTCLR_Bits.CLR */
#define IFX_CAN_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_KRSTCLR_Bits.CLR */
#define IFX_CAN_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_CAN_LGMR_Bits.LGM */
#define IFX_CAN_LGMR_LGM_LEN (16)

/** \\brief  Mask for Ifx_CAN_LGMR_Bits.LGM */
#define IFX_CAN_LGMR_LGM_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_LGMR_Bits.LGM */
#define IFX_CAN_LGMR_LGM_OFF (16)

/** \\brief  Length for Ifx_CAN_LGMR_Bits.LGMFR */
#define IFX_CAN_LGMR_LGMFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_LGMR_Bits.LGMFR */
#define IFX_CAN_LGMR_LGMFR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_LGMR_Bits.LGMFR */
#define IFX_CAN_LGMR_LGMFR_OFF (9)

/** \\brief  Length for Ifx_CAN_LIST_Bits.BEGIN */
#define IFX_CAN_LIST_BEGIN_LEN (8)

/** \\brief  Mask for Ifx_CAN_LIST_Bits.BEGIN */
#define IFX_CAN_LIST_BEGIN_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_LIST_Bits.BEGIN */
#define IFX_CAN_LIST_BEGIN_OFF (0)

/** \\brief  Length for Ifx_CAN_LIST_Bits.EMPTY */
#define IFX_CAN_LIST_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_CAN_LIST_Bits.EMPTY */
#define IFX_CAN_LIST_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_LIST_Bits.EMPTY */
#define IFX_CAN_LIST_EMPTY_OFF (24)

/** \\brief  Length for Ifx_CAN_LIST_Bits.END */
#define IFX_CAN_LIST_END_LEN (8)

/** \\brief  Mask for Ifx_CAN_LIST_Bits.END */
#define IFX_CAN_LIST_END_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_LIST_Bits.END */
#define IFX_CAN_LIST_END_OFF (8)

/** \\brief  Length for Ifx_CAN_LIST_Bits.SIZE */
#define IFX_CAN_LIST_SIZE_LEN (8)

/** \\brief  Mask for Ifx_CAN_LIST_Bits.SIZE */
#define IFX_CAN_LIST_SIZE_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_LIST_Bits.SIZE */
#define IFX_CAN_LIST_SIZE_OFF (16)

/** \\brief  Length for Ifx_CAN_LOR_Bits.DISC */
#define IFX_CAN_LOR_DISC_LEN (1)

/** \\brief  Mask for Ifx_CAN_LOR_Bits.DISC */
#define IFX_CAN_LOR_DISC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_LOR_Bits.DISC */
#define IFX_CAN_LOR_DISC_OFF (1)

/** \\brief  Length for Ifx_CAN_LOR_Bits.LOF */
#define IFX_CAN_LOR_LOF_LEN (16)

/** \\brief  Mask for Ifx_CAN_LOR_Bits.LOF */
#define IFX_CAN_LOR_LOF_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_LOR_Bits.LOF */
#define IFX_CAN_LOR_LOF_OFF (16)

/** \\brief  Length for Ifx_CAN_LOR_Bits.LOFFR */
#define IFX_CAN_LOR_LOFFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_LOR_Bits.LOFFR */
#define IFX_CAN_LOR_LOFFR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_LOR_Bits.LOFFR */
#define IFX_CAN_LOR_LOFFR_OFF (9)

/** \\brief  Length for Ifx_CAN_LOR_Bits.NEWDISC */
#define IFX_CAN_LOR_NEWDISC_LEN (1)

/** \\brief  Mask for Ifx_CAN_LOR_Bits.NEWDISC */
#define IFX_CAN_LOR_NEWDISC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_LOR_Bits.NEWDISC */
#define IFX_CAN_LOR_NEWDISC_OFF (0)

/** \\brief  Length for Ifx_CAN_LREFMR_Bits.LREFM */
#define IFX_CAN_LREFMR_LREFM_LEN (16)

/** \\brief  Mask for Ifx_CAN_LREFMR_Bits.LREFM */
#define IFX_CAN_LREFMR_LREFM_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_LREFMR_Bits.LREFM */
#define IFX_CAN_LREFMR_LREFM_OFF (16)

/** \\brief  Length for Ifx_CAN_LREFMR_Bits.LREFMFR */
#define IFX_CAN_LREFMR_LREFMFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_LREFMR_Bits.LREFMFR */
#define IFX_CAN_LREFMR_LREFMFR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_LREFMR_Bits.LREFMFR */
#define IFX_CAN_LREFMR_LREFMFR_OFF (9)

/** \\brief  Length for Ifx_CAN_LTCR_Bits.LTC */
#define IFX_CAN_LTCR_LTC_LEN (16)

/** \\brief  Mask for Ifx_CAN_LTCR_Bits.LTC */
#define IFX_CAN_LTCR_LTC_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_LTCR_Bits.LTC */
#define IFX_CAN_LTCR_LTC_OFF (16)

/** \\brief  Length for Ifx_CAN_LTCR_Bits.LTFRC */
#define IFX_CAN_LTCR_LTFRC_LEN (10)

/** \\brief  Mask for Ifx_CAN_LTCR_Bits.LTFRC */
#define IFX_CAN_LTCR_LTFRC_MSK (0x3ff)

/** \\brief  Offset for Ifx_CAN_LTCR_Bits.LTFRC */
#define IFX_CAN_LTCR_LTFRC_OFF (6)

/** \\brief  Length for Ifx_CAN_LTR_Bits.LT */
#define IFX_CAN_LTR_LT_LEN (16)

/** \\brief  Mask for Ifx_CAN_LTR_Bits.LT */
#define IFX_CAN_LTR_LT_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_LTR_Bits.LT */
#define IFX_CAN_LTR_LT_OFF (16)

/** \\brief  Length for Ifx_CAN_LTR_Bits.LTFR */
#define IFX_CAN_LTR_LTFR_LEN (10)

/** \\brief  Mask for Ifx_CAN_LTR_Bits.LTFR */
#define IFX_CAN_LTR_LTFR_MSK (0x3ff)

/** \\brief  Offset for Ifx_CAN_LTR_Bits.LTFR */
#define IFX_CAN_LTR_LTFR_OFF (6)

/** \\brief  Length for Ifx_CAN_MCR_Bits.CLKSEL */
#define IFX_CAN_MCR_CLKSEL_LEN (4)

/** \\brief  Mask for Ifx_CAN_MCR_Bits.CLKSEL */
#define IFX_CAN_MCR_CLKSEL_MSK (0xf)

