HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETMSGVAL */
#define IFX_CAN_MO_CTR_SETMSGVAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETMSGVAL */
#define IFX_CAN_MO_CTR_SETMSGVAL_OFF (21)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_SETNEWDAT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_SETNEWDAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_SETNEWDAT_OFF (19)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETRTSEL */
#define IFX_CAN_MO_CTR_SETRTSEL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETRTSEL */
#define IFX_CAN_MO_CTR_SETRTSEL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETRTSEL */
#define IFX_CAN_MO_CTR_SETRTSEL_OFF (22)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETRXEN */
#define IFX_CAN_MO_CTR_SETRXEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETRXEN */
#define IFX_CAN_MO_CTR_SETRXEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETRXEN */
#define IFX_CAN_MO_CTR_SETRXEN_OFF (23)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETRXPND */
#define IFX_CAN_MO_CTR_SETRXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETRXPND */
#define IFX_CAN_MO_CTR_SETRXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETRXPND */
#define IFX_CAN_MO_CTR_SETRXPND_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_SETRXUPD_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_SETRXUPD_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_SETRXUPD_OFF (18)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_SETTXEN0_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_SETTXEN0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_SETTXEN0_OFF (25)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_SETTXEN1_OFF (26)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_SETTXPND_OFF (17)

/** \\brief  Length for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_SETTXRQ_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB4 */
#define IFX_CAN_MO_DATAH_DB4_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB5 */
#define IFX_CAN_MO_DATAH_DB5_OFF (8)

/** \\brief  Length for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB6 */
#define IFX_CAN_MO_DATAH_DB6_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAH_Bits.DB7 */
#define IFX_CAN_MO_DATAH_DB7_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB0 */
#define IFX_CAN_MO_DATAL_DB0_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB1 */
#define IFX_CAN_MO_DATAL_DB1_OFF (8)

/** \\brief  Length for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB2 */
#define IFX_CAN_MO_DATAL_DB2_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_DATAL_Bits.DB3 */
#define IFX_CAN_MO_DATAL_DB3_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_OFF (11)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_OFF (10)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.FRREN */
#define IFX_CAN_MO_FCR_FRREN_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.FRREN */
#define IFX_CAN_MO_FCR_FRREN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.FRREN */
#define IFX_CAN_MO_FCR_FRREN_OFF (20)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.GDFS */
#define IFX_CAN_MO_FCR_GDFS_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.GDFS */
#define IFX_CAN_MO_FCR_GDFS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.GDFS */
#define IFX_CAN_MO_FCR_GDFS_OFF (8)

