HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.IDC */
#define IFX_CAN_MO_FCR_IDC_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.IDC */
#define IFX_CAN_MO_FCR_IDC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.IDC */
#define IFX_CAN_MO_FCR_IDC_OFF (9)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.MMC */
#define IFX_CAN_MO_FCR_MMC_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.MMC */
#define IFX_CAN_MO_FCR_MMC_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.MMC */
#define IFX_CAN_MO_FCR_MMC_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.MSC */
#define IFX_CAN_MO_FCR_MSC_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.MSC */
#define IFX_CAN_MO_FCR_MSC_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.MSC */
#define IFX_CAN_MO_FCR_MSC_OFF (28)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.OVIE */
#define IFX_CAN_MO_FCR_OVIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.OVIE */
#define IFX_CAN_MO_FCR_OVIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.OVIE */
#define IFX_CAN_MO_FCR_OVIE_OFF (18)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.RMM */
#define IFX_CAN_MO_FCR_RMM_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.RMM */
#define IFX_CAN_MO_FCR_RMM_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.RMM */
#define IFX_CAN_MO_FCR_RMM_OFF (21)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.RXIE */
#define IFX_CAN_MO_FCR_RXIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.RXIE */
#define IFX_CAN_MO_FCR_RXIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.RXIE */
#define IFX_CAN_MO_FCR_RXIE_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.RXTOE */
#define IFX_CAN_MO_FCR_RXTOE_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.RXTOE */
#define IFX_CAN_MO_FCR_RXTOE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.RXTOE */
#define IFX_CAN_MO_FCR_RXTOE_OFF (4)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.SDT */
#define IFX_CAN_MO_FCR_SDT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.SDT */
#define IFX_CAN_MO_FCR_SDT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.SDT */
#define IFX_CAN_MO_FCR_SDT_OFF (22)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.STT */
#define IFX_CAN_MO_FCR_STT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.STT */
#define IFX_CAN_MO_FCR_STT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.STT */
#define IFX_CAN_MO_FCR_STT_OFF (23)

/** \\brief  Length for Ifx_CAN_MO_FCR_Bits.TXIE */
#define IFX_CAN_MO_FCR_TXIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_FCR_Bits.TXIE */
#define IFX_CAN_MO_FCR_TXIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_FCR_Bits.TXIE */
#define IFX_CAN_MO_FCR_TXIE_OFF (17)

/** \\brief  Length for Ifx_CAN_MO_FGPR_Bits.BOT */
#define IFX_CAN_MO_FGPR_BOT_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_FGPR_Bits.BOT */
#define IFX_CAN_MO_FGPR_BOT_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_FGPR_Bits.BOT */
#define IFX_CAN_MO_FGPR_BOT_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_FGPR_Bits.CUR */
#define IFX_CAN_MO_FGPR_CUR_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_FGPR_Bits.CUR */
#define IFX_CAN_MO_FGPR_CUR_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_FGPR_Bits.CUR */
#define IFX_CAN_MO_FGPR_CUR_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_FGPR_Bits.SEL */
#define IFX_CAN_MO_FGPR_SEL_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_FGPR_Bits.SEL */
#define IFX_CAN_MO_FGPR_SEL_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_FGPR_Bits.SEL */
#define IFX_CAN_MO_FGPR_SEL_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_FGPR_Bits.TOP */
#define IFX_CAN_MO_FGPR_TOP_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_FGPR_Bits.TOP */
#define IFX_CAN_MO_FGPR_TOP_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_FGPR_Bits.TOP */
#define IFX_CAN_MO_FGPR_TOP_OFF (8)

/** \\brief  Length for Ifx_CAN_MO_IPR_Bits.CFCVAL */
#define IFX_CAN_MO_IPR_CFCVAL_LEN (16)

/** \\brief  Mask for Ifx_CAN_MO_IPR_Bits.CFCVAL */
#define IFX_CAN_MO_IPR_CFCVAL_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_MO_IPR_Bits.CFCVAL */
#define IFX_CAN_MO_IPR_CFCVAL_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_IPR_Bits.MPN */
#define IFX_CAN_MO_IPR_MPN_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_IPR_Bits.MPN */
#define IFX_CAN_MO_IPR_MPN_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_IPR_Bits.MPN */
#define IFX_CAN_MO_IPR_MPN_OFF (8)

/** \\brief  Length for Ifx_CAN_MO_IPR_Bits.RXINP */
#define IFX_CAN_MO_IPR_RXINP_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_IPR_Bits.RXINP */
#define IFX_CAN_MO_IPR_RXINP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_IPR_Bits.RXINP */
#define IFX_CAN_MO_IPR_RXINP_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_IPR_Bits.TXINP */
#define IFX_CAN_MO_IPR_TXINP_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_IPR_Bits.TXINP */
#define IFX_CAN_MO_IPR_TXINP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_IPR_Bits.TXINP */
#define IFX_CAN_MO_IPR_TXINP_OFF (4)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.DIR */
#define IFX_CAN_MO_STAT_DIR_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.DIR */
#define IFX_CAN_MO_STAT_DIR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.DIR */
#define IFX_CAN_MO_STAT_DIR_OFF (11)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.LIST */
#define IFX_CAN_MO_STAT_LIST_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.LIST */
#define IFX_CAN_MO_STAT_LIST_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.LIST */
#define IFX_CAN_MO_STAT_LIST_OFF (12)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.MSGLST */
#define IFX_CAN_MO_STAT_MSGLST_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.MSGLST */
#define IFX_CAN_MO_STAT_MSGLST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.MSGLST */
#define IFX_CAN_MO_STAT_MSGLST_OFF (4)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_STAT_MSGVAL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_STAT_MSGVAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_STAT_MSGVAL_OFF (5)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_LEN (1)

