HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_OFF (3)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_OFF (6)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_OFF (7)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_OFF (2)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_OFF (9)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_OFF (10)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_OFF (1)

/** \\brief  Length for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_OFF (8)

/** \\brief  Length for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_LEN (6)

/** \\brief  Mask for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_MSK (0x3f)

/** \\brief  Offset for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_OFF (0)

/** \\brief  Length for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_LEN (32)

/** \\brief  Mask for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_OFF (0)

/** \\brief  Length for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_LEN (32)

/** \\brief  Mask for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_OFF (0)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_LEN (6)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_MSK (0x3f)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_OFF (0)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_LEN (1)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_OFF (15)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.FTX */
#define IFX_CAN_N_BTR_FTX_LEN (1)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.FTX */
#define IFX_CAN_N_BTR_FTX_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.FTX */
#define IFX_CAN_N_BTR_FTX_OFF (16)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_LEN (2)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_OFF (6)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.TSEG1 */
#define IFX_CAN_N_BTR_TSEG1_LEN (4)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.TSEG1 */
#define IFX_CAN_N_BTR_TSEG1_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.TSEG1 */
#define IFX_CAN_N_BTR_TSEG1_OFF (8)

/** \\brief  Length for Ifx_CAN_N_BTR_Bits.TSEG2 */
#define IFX_CAN_N_BTR_TSEG2_LEN (3)

/** \\brief  Mask for Ifx_CAN_N_BTR_Bits.TSEG2 */
#define IFX_CAN_N_BTR_TSEG2_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_N_BTR_Bits.TSEG2 */
#define IFX_CAN_N_BTR_TSEG2_OFF (12)

/** \\brief  Length for Ifx_CAN_N_CR_Bits.ALIE */
#define IFX_CAN_N_CR_ALIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_N_CR_Bits.ALIE */
#define IFX_CAN_N_CR_ALIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_N_CR_Bits.ALIE */
#define IFX_CAN_N_CR_ALIE_OFF (3)

/** \\brief  Length for Ifx_CAN_N_CR_Bits.CALM */
#define IFX_CAN_N_CR_CALM_LEN (1)

/** \\brief  Mask for Ifx_CAN_N_CR_Bits.CALM */
#define IFX_CAN_N_CR_CALM_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_N_CR_Bits.CALM */
#define IFX_CAN_N_CR_CALM_OFF (7)

/** \\brief  Length for Ifx_CAN_N_CR_Bits.CANDIS */
#define IFX_CAN_N_CR_CANDIS_LEN (1)

/** \\brief  Mask for Ifx_CAN_N_CR_Bits.CANDIS */
#define IFX_CAN_N_CR_CANDIS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_N_CR_Bits.CANDIS */
#define IFX_CAN_N_CR_CANDIS_OFF (4)

