HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Length for Ifx_CAN_REFMR_Bits.REFMFR */
#define IFX_CAN_REFMR_REFMFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_REFMR_Bits.REFMFR */
#define IFX_CAN_REFMR_REFMFR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_REFMR_Bits.REFMFR */
#define IFX_CAN_REFMR_REFMFR_OFF (9)

/** \\brief  Length for Ifx_CAN_SISR_Bits.ALTMSG */
#define IFX_CAN_SISR_ALTMSG_LEN (2)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.ALTMSG */
#define IFX_CAN_SISR_ALTMSG_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.ALTMSG */
#define IFX_CAN_SISR_ALTMSG_OFF (10)

/** \\brief  Length for Ifx_CAN_SISR_Bits.ARBM */
#define IFX_CAN_SISR_ARBM_LEN (2)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.ARBM */
#define IFX_CAN_SISR_ARBM_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.ARBM */
#define IFX_CAN_SISR_ARBM_OFF (12)

/** \\brief  Length for Ifx_CAN_SISR_Bits.ARBV */
#define IFX_CAN_SISR_ARBV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.ARBV */
#define IFX_CAN_SISR_ARBV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.ARBV */
#define IFX_CAN_SISR_ARBV_OFF (19)

/** \\brief  Length for Ifx_CAN_SISR_Bits.BCEV */
#define IFX_CAN_SISR_BCEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.BCEV */
#define IFX_CAN_SISR_BCEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.BCEV */
#define IFX_CAN_SISR_BCEV_OFF (22)

/** \\brief  Length for Ifx_CAN_SISR_Bits.CHEN */
#define IFX_CAN_SISR_CHEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.CHEN */
#define IFX_CAN_SISR_CHEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.CHEN */
#define IFX_CAN_SISR_CHEN_OFF (8)

/** \\brief  Length for Ifx_CAN_SISR_Bits.GM */
#define IFX_CAN_SISR_GM_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.GM */
#define IFX_CAN_SISR_GM_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.GM */
#define IFX_CAN_SISR_GM_OFF (14)

/** \\brief  Length for Ifx_CAN_SISR_Bits.ICEV */
#define IFX_CAN_SISR_ICEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.ICEV */
#define IFX_CAN_SISR_ICEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.ICEV */
#define IFX_CAN_SISR_ICEV_OFF (18)

/** \\brief  Length for Ifx_CAN_SISR_Bits.ICF */
#define IFX_CAN_SISR_ICF_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.ICF */
#define IFX_CAN_SISR_ICF_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.ICF */
#define IFX_CAN_SISR_ICF_OFF (15)

/** \\brief  Length for Ifx_CAN_SISR_Bits.IENRECF0 */
#define IFX_CAN_SISR_IENRECF0_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.IENRECF0 */
#define IFX_CAN_SISR_IENRECF0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.IENRECF0 */
#define IFX_CAN_SISR_IENRECF0_OFF (6)

/** \\brief  Length for Ifx_CAN_SISR_Bits.IENRECF1 */
#define IFX_CAN_SISR_IENRECF1_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.IENRECF1 */
#define IFX_CAN_SISR_IENRECF1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.IENRECF1 */
#define IFX_CAN_SISR_IENRECF1_OFF (7)

/** \\brief  Length for Ifx_CAN_SISR_Bits.IENTRAF0 */
#define IFX_CAN_SISR_IENTRAF0_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.IENTRAF0 */
#define IFX_CAN_SISR_IENTRAF0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.IENTRAF0 */
#define IFX_CAN_SISR_IENTRAF0_OFF (4)

/** \\brief  Length for Ifx_CAN_SISR_Bits.IENTRAF1 */
#define IFX_CAN_SISR_IENTRAF1_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.IENTRAF1 */
#define IFX_CAN_SISR_IENTRAF1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.IENTRAF1 */
#define IFX_CAN_SISR_IENTRAF1_OFF (5)

/** \\brief  Length for Ifx_CAN_SISR_Bits.INP */
#define IFX_CAN_SISR_INP_LEN (4)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.INP */
#define IFX_CAN_SISR_INP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.INP */
#define IFX_CAN_SISR_INP_OFF (0)

/** \\brief  Length for Ifx_CAN_SISR_Bits.RCEV */
#define IFX_CAN_SISR_RCEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.RCEV */
#define IFX_CAN_SISR_RCEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.RCEV */
#define IFX_CAN_SISR_RCEV_OFF (16)

/** \\brief  Length for Ifx_CAN_SISR_Bits.RMEV */
#define IFX_CAN_SISR_RMEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.RMEV */
#define IFX_CAN_SISR_RMEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.RMEV */
#define IFX_CAN_SISR_RMEV_OFF (21)

/** \\brief  Length for Ifx_CAN_SISR_Bits.TCEV */
#define IFX_CAN_SISR_TCEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.TCEV */
#define IFX_CAN_SISR_TCEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.TCEV */
#define IFX_CAN_SISR_TCEV_OFF (17)

/** \\brief  Length for Ifx_CAN_SISR_Bits.TMEV */
#define IFX_CAN_SISR_TMEV_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.TMEV */
#define IFX_CAN_SISR_TMEV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.TMEV */
#define IFX_CAN_SISR_TMEV_OFF (20)

/** \\brief  Length for Ifx_CAN_SISR_Bits.TREN */
#define IFX_CAN_SISR_TREN_LEN (1)

/** \\brief  Mask for Ifx_CAN_SISR_Bits.TREN */
#define IFX_CAN_SISR_TREN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_SISR_Bits.TREN */
#define IFX_CAN_SISR_TREN_OFF (9)

/** \\brief  Length for Ifx_CAN_STPTR0_Bits.STPTR */
#define IFX_CAN_STPTR0_STPTR_LEN (7)

/** \\brief  Mask for Ifx_CAN_STPTR0_Bits.STPTR */
#define IFX_CAN_STPTR0_STPTR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_STPTR0_Bits.STPTR */
#define IFX_CAN_STPTR0_STPTR_OFF (0)

/** \\brief  Length for Ifx_CAN_STSRH_Bits.RCEMSGNR */
#define IFX_CAN_STSRH_RCEMSGNR_LEN (8)

/** \\brief  Mask for Ifx_CAN_STSRH_Bits.RCEMSGNR */
#define IFX_CAN_STSRH_RCEMSGNR_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_STSRH_Bits.RCEMSGNR */
#define IFX_CAN_STSRH_RCEMSGNR_OFF (16)

/** \\brief  Length for Ifx_CAN_STSRH_Bits.TCEMSGNR */
#define IFX_CAN_STSRH_TCEMSGNR_LEN (8)

/** \\brief  Mask for Ifx_CAN_STSRH_Bits.TCEMSGNR */
#define IFX_CAN_STSRH_TCEMSGNR_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_STSRH_Bits.TCEMSGNR */
#define IFX_CAN_STSRH_TCEMSGNR_OFF (24)

/** \\brief  Length for Ifx_CAN_STSRH_Bits.TMETMV */
#define IFX_CAN_STSRH_TMETMV_LEN (16)

/** \\brief  Mask for Ifx_CAN_STSRH_Bits.TMETMV */
#define IFX_CAN_STSRH_TMETMV_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_STSRH_Bits.TMETMV */
#define IFX_CAN_STSRH_TMETMV_OFF (0)

