HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Length for Ifx_CAN_STSRL_Bits.BCETMV */
#define IFX_CAN_STSRL_BCETMV_LEN (16)

/** \\brief  Mask for Ifx_CAN_STSRL_Bits.BCETMV */
#define IFX_CAN_STSRL_BCETMV_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_STSRL_Bits.BCETMV */
#define IFX_CAN_STSRL_BCETMV_OFF (16)

/** \\brief  Length for Ifx_CAN_STSRL_Bits.RMETMV */
#define IFX_CAN_STSRL_RMETMV_LEN (16)

/** \\brief  Mask for Ifx_CAN_STSRL_Bits.RMETMV */
#define IFX_CAN_STSRL_RMETMV_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_STSRL_Bits.RMETMV */
#define IFX_CAN_STSRL_RMETMV_OFF (0)

/** \\brief  Length for Ifx_CAN_SYNMR_Bits.SYNM */
#define IFX_CAN_SYNMR_SYNM_LEN (16)

/** \\brief  Mask for Ifx_CAN_SYNMR_Bits.SYNM */
#define IFX_CAN_SYNMR_SYNM_MSK (0xffff)

/** \\brief  Offset for Ifx_CAN_SYNMR_Bits.SYNM */
#define IFX_CAN_SYNMR_SYNM_OFF (16)

/** \\brief  Length for Ifx_CAN_SYNMR_Bits.SYNMFR */
#define IFX_CAN_SYNMR_SYNMFR_LEN (7)

/** \\brief  Mask for Ifx_CAN_SYNMR_Bits.SYNMFR */
#define IFX_CAN_SYNMR_SYNMFR_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_SYNMR_Bits.SYNMFR */
#define IFX_CAN_SYNMR_SYNMFR_OFF (9)

/** \\brief  Length for Ifx_CAN_TTCFGR_Bits.EXPTT */
#define IFX_CAN_TTCFGR_EXPTT_LEN (8)

/** \\brief  Mask for Ifx_CAN_TTCFGR_Bits.EXPTT */
#define IFX_CAN_TTCFGR_EXPTT_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_TTCFGR_Bits.EXPTT */
#define IFX_CAN_TTCFGR_EXPTT_OFF (8)

/** \\brief  Length for Ifx_CAN_TTCFGR_Bits.IRO */
#define IFX_CAN_TTCFGR_IRO_LEN (7)

/** \\brief  Mask for Ifx_CAN_TTCFGR_Bits.IRO */
#define IFX_CAN_TTCFGR_IRO_MSK (0x7f)

/** \\brief  Offset for Ifx_CAN_TTCFGR_Bits.IRO */
#define IFX_CAN_TTCFGR_IRO_OFF (0)

/** \\brief  Length for Ifx_CAN_TTCFGR_Bits.RTO */
#define IFX_CAN_TTCFGR_RTO_LEN (8)

/** \\brief  Mask for Ifx_CAN_TTCFGR_Bits.RTO */
#define IFX_CAN_TTCFGR_RTO_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_TTCFGR_Bits.RTO */
#define IFX_CAN_TTCFGR_RTO_OFF (16)

/** \\brief  Length for Ifx_CAN_TTCFGR_Bits.TTCNT */
#define IFX_CAN_TTCFGR_TTCNT_LEN (8)

/** \\brief  Mask for Ifx_CAN_TTCFGR_Bits.TTCNT */
#define IFX_CAN_TTCFGR_TTCNT_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_TTCFGR_Bits.TTCNT */
#define IFX_CAN_TTCFGR_TTCNT_OFF (24)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.CYCLE */
#define IFX_CAN_TTCR_CYCLE_LEN (6)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.CYCLE */
#define IFX_CAN_TTCR_CYCLE_MSK (0x3f)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.CYCLE */
#define IFX_CAN_TTCR_CYCLE_OFF (16)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.ETESEL */
#define IFX_CAN_TTCR_ETESEL_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.ETESEL */
#define IFX_CAN_TTCR_ETESEL_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.ETESEL */
#define IFX_CAN_TTCR_ETESEL_OFF (2)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.ETM */
#define IFX_CAN_TTCR_ETM_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.ETM */
#define IFX_CAN_TTCR_ETM_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.ETM */
#define IFX_CAN_TTCR_ETM_OFF (7)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.ETSSEL */
#define IFX_CAN_TTCR_ETSSEL_LEN (3)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.ETSSEL */
#define IFX_CAN_TTCR_ETSSEL_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.ETSSEL */
#define IFX_CAN_TTCR_ETSSEL_OFF (4)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.ETSSEX */
#define IFX_CAN_TTCR_ETSSEX_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.ETSSEX */
#define IFX_CAN_TTCR_ETSSEX_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.ETSSEX */
#define IFX_CAN_TTCR_ETSSEX_OFF (15)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.LTCTSS */
#define IFX_CAN_TTCR_LTCTSS_LEN (3)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.LTCTSS */
#define IFX_CAN_TTCR_LTCTSS_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.LTCTSS */
#define IFX_CAN_TTCR_LTCTSS_OFF (9)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.RMDLC */
#define IFX_CAN_TTCR_RMDLC_LEN (4)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.RMDLC */
#define IFX_CAN_TTCR_RMDLC_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.RMDLC */
#define IFX_CAN_TTCR_RMDLC_OFF (28)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.TENW */
#define IFX_CAN_TTCR_TENW_LEN (4)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.TENW */
#define IFX_CAN_TTCR_TENW_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.TENW */
#define IFX_CAN_TTCR_TENW_OFF (24)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.TMPRIO */
#define IFX_CAN_TTCR_TMPRIO_LEN (3)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.TMPRIO */
#define IFX_CAN_TTCR_TMPRIO_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.TMPRIO */
#define IFX_CAN_TTCR_TMPRIO_OFF (12)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.TTLVL */
#define IFX_CAN_TTCR_TTLVL_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.TTLVL */
#define IFX_CAN_TTCR_TTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.TTLVL */
#define IFX_CAN_TTCR_TTLVL_OFF (8)

/** \\brief  Length for Ifx_CAN_TTCR_Bits.TTM */
#define IFX_CAN_TTCR_TTM_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTCR_Bits.TTM */
#define IFX_CAN_TTCR_TTM_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTCR_Bits.TTM */
#define IFX_CAN_TTCR_TTM_OFF (0)

/** \\brief  Length for Ifx_CAN_TTFMR_Bits.CFGMEL */
#define IFX_CAN_TTFMR_CFGMEL_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTFMR_Bits.CFGMEL */
#define IFX_CAN_TTFMR_CFGMEL_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTFMR_Bits.CFGMEL */
#define IFX_CAN_TTFMR_CFGMEL_OFF (0)

/** \\brief  Length for Ifx_CAN_TTFMR_Bits.ETREVR */
#define IFX_CAN_TTFMR_ETREVR_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTFMR_Bits.ETREVR */
#define IFX_CAN_TTFMR_ETREVR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTFMR_Bits.ETREVR */
#define IFX_CAN_TTFMR_ETREVR_OFF (5)

/** \\brief  Length for Ifx_CAN_TTFMR_Bits.NIGSR */
#define IFX_CAN_TTFMR_NIGSR_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTFMR_Bits.NIGSR */
#define IFX_CAN_TTFMR_NIGSR_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTFMR_Bits.NIGSR */
#define IFX_CAN_TTFMR_NIGSR_OFF (2)

/** \\brief  Length for Ifx_CAN_TTFMR_Bits.STE */
#define IFX_CAN_TTFMR_STE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTFMR_Bits.STE */
#define IFX_CAN_TTFMR_STE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTFMR_Bits.STE */
#define IFX_CAN_TTFMR_STE_OFF (4)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.AWDIE */
#define IFX_CAN_TTIER_AWDIE_LEN (1)

