HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Mask for Ifx_CAN_TTIER_Bits.AWDIE */
#define IFX_CAN_TTIER_AWDIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.AWDIE */
#define IFX_CAN_TTIER_AWDIE_OFF (7)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.ERRSCIE */
#define IFX_CAN_TTIER_ERRSCIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.ERRSCIE */
#define IFX_CAN_TTIER_ERRSCIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.ERRSCIE */
#define IFX_CAN_TTIER_ERRSCIE_OFF (8)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.MSRCIE */
#define IFX_CAN_TTIER_MSRCIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.MSRCIE */
#define IFX_CAN_TTIER_MSRCIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.MSRCIE */
#define IFX_CAN_TTIER_MSRCIE_OFF (9)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.NBCIE */
#define IFX_CAN_TTIER_NBCIE_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.NBCIE */
#define IFX_CAN_TTIER_NBCIE_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.NBCIE */
#define IFX_CAN_TTIER_NBCIE_OFF (0)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.NOTIFIE */
#define IFX_CAN_TTIER_NOTIFIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.NOTIFIE */
#define IFX_CAN_TTIER_NOTIFIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.NOTIFIE */
#define IFX_CAN_TTIER_NOTIFIE_OFF (12)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.SEIE */
#define IFX_CAN_TTIER_SEIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.SEIE */
#define IFX_CAN_TTIER_SEIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.SEIE */
#define IFX_CAN_TTIER_SEIE_OFF (11)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.SYNCSCIE */
#define IFX_CAN_TTIER_SYNCSCIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.SYNCSCIE */
#define IFX_CAN_TTIER_SYNCSCIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.SYNCSCIE */
#define IFX_CAN_TTIER_SYNCSCIE_OFF (10)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.TENWERIE */
#define IFX_CAN_TTIER_TENWERIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.TENWERIE */
#define IFX_CAN_TTIER_TENWERIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.TENWERIE */
#define IFX_CAN_TTIER_TENWERIE_OFF (2)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.TTERIE */
#define IFX_CAN_TTIER_TTERIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.TTERIE */
#define IFX_CAN_TTIER_TTERIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.TTERIE */
#define IFX_CAN_TTIER_TTERIE_OFF (3)

/** \\brief  Length for Ifx_CAN_TTIER_Bits.WTEIE */
#define IFX_CAN_TTIER_WTEIE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIER_Bits.WTEIE */
#define IFX_CAN_TTIER_WTEIE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIER_Bits.WTEIE */
#define IFX_CAN_TTIER_WTEIE_OFF (6)

/** \\brief  Length for Ifx_CAN_TTINPR_Bits.ERRINP */
#define IFX_CAN_TTINPR_ERRINP_LEN (4)

/** \\brief  Mask for Ifx_CAN_TTINPR_Bits.ERRINP */
#define IFX_CAN_TTINPR_ERRINP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_TTINPR_Bits.ERRINP */
#define IFX_CAN_TTINPR_ERRINP_OFF (0)

/** \\brief  Length for Ifx_CAN_TTINPR_Bits.NBCINP */
#define IFX_CAN_TTINPR_NBCINP_LEN (4)

/** \\brief  Mask for Ifx_CAN_TTINPR_Bits.NBCINP */
#define IFX_CAN_TTINPR_NBCINP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_TTINPR_Bits.NBCINP */
#define IFX_CAN_TTINPR_NBCINP_OFF (4)

/** \\brief  Length for Ifx_CAN_TTINPR_Bits.NOTIFINP */
#define IFX_CAN_TTINPR_NOTIFINP_LEN (4)

/** \\brief  Mask for Ifx_CAN_TTINPR_Bits.NOTIFINP */
#define IFX_CAN_TTINPR_NOTIFINP_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_TTINPR_Bits.NOTIFINP */
#define IFX_CAN_TTINPR_NOTIFINP_OFF (8)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.AWDERR */
#define IFX_CAN_TTIRR_AWDERR_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.AWDERR */
#define IFX_CAN_TTIRR_AWDERR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.AWDERR */
#define IFX_CAN_TTIRR_AWDERR_OFF (7)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.CFGERR */
#define IFX_CAN_TTIRR_CFGERR_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.CFGERR */
#define IFX_CAN_TTIRR_CFGERR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.CFGERR */
#define IFX_CAN_TTIRR_CFGERR_OFF (16)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.DISC */
#define IFX_CAN_TTIRR_DISC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.DISC */
#define IFX_CAN_TTIRR_DISC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.DISC */
#define IFX_CAN_TTIRR_DISC_OFF (13)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.EOS */
#define IFX_CAN_TTIRR_EOS_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.EOS */
#define IFX_CAN_TTIRR_EOS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.EOS */
#define IFX_CAN_TTIRR_EOS_OFF (11)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.ERRSC */
#define IFX_CAN_TTIRR_ERRSC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.ERRSC */
#define IFX_CAN_TTIRR_ERRSC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.ERRSC */
#define IFX_CAN_TTIRR_ERRSC_OFF (8)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.IWTE */
#define IFX_CAN_TTIRR_IWTE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.IWTE */
#define IFX_CAN_TTIRR_IWTE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.IWTE */
#define IFX_CAN_TTIRR_IWTE_OFF (6)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.MSRC */
#define IFX_CAN_TTIRR_MSRC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.MSRC */
#define IFX_CAN_TTIRR_MSRC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.MSRC */
#define IFX_CAN_TTIRR_MSRC_OFF (9)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.NBC */
#define IFX_CAN_TTIRR_NBC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.NBC */
#define IFX_CAN_TTIRR_NBC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.NBC */
#define IFX_CAN_TTIRR_NBC_OFF (1)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.NMC */
#define IFX_CAN_TTIRR_NMC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.NMC */
#define IFX_CAN_TTIRR_NMC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.NMC */
#define IFX_CAN_TTIRR_NMC_OFF (0)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.SERR1 */
#define IFX_CAN_TTIRR_SERR1_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.SERR1 */
#define IFX_CAN_TTIRR_SERR1_MSK (0x1)

