HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.SERR1 */
#define IFX_CAN_TTIRR_SERR1_OFF (14)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.SERR2 */
#define IFX_CAN_TTIRR_SERR2_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.SERR2 */
#define IFX_CAN_TTIRR_SERR2_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.SERR2 */
#define IFX_CAN_TTIRR_SERR2_OFF (15)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.SYNCSC */
#define IFX_CAN_TTIRR_SYNCSC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.SYNCSC */
#define IFX_CAN_TTIRR_SYNCSC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.SYNCSC */
#define IFX_CAN_TTIRR_SYNCSC_OFF (10)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.TENWER */
#define IFX_CAN_TTIRR_TENWER_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.TENWER */
#define IFX_CAN_TTIRR_TENWER_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.TENWER */
#define IFX_CAN_TTIRR_TENWER_OFF (2)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.TTOF */
#define IFX_CAN_TTIRR_TTOF_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.TTOF */
#define IFX_CAN_TTIRR_TTOF_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.TTOF */
#define IFX_CAN_TTIRR_TTOF_OFF (4)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.TTUF */
#define IFX_CAN_TTIRR_TTUF_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.TTUF */
#define IFX_CAN_TTIRR_TTUF_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.TTUF */
#define IFX_CAN_TTIRR_TTUF_OFF (3)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.TURERR */
#define IFX_CAN_TTIRR_TURERR_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.TURERR */
#define IFX_CAN_TTIRR_TURERR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.TURERR */
#define IFX_CAN_TTIRR_TURERR_OFF (17)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.WFE */
#define IFX_CAN_TTIRR_WFE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.WFE */
#define IFX_CAN_TTIRR_WFE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.WFE */
#define IFX_CAN_TTIRR_WFE_OFF (12)

/** \\brief  Length for Ifx_CAN_TTIRR_Bits.WTE */
#define IFX_CAN_TTIRR_WTE_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTIRR_Bits.WTE */
#define IFX_CAN_TTIRR_WTE_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTIRR_Bits.WTE */
#define IFX_CAN_TTIRR_WTE_OFF (5)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.ARB */
#define IFX_CAN_TTSR_ARB_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.ARB */
#define IFX_CAN_TTSR_ARB_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.ARB */
#define IFX_CAN_TTSR_ARB_OFF (11)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.CFGM */
#define IFX_CAN_TTSR_CFGM_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.CFGM */
#define IFX_CAN_TTSR_CFGM_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.CFGM */
#define IFX_CAN_TTSR_CFGM_OFF (12)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.EFF */
#define IFX_CAN_TTSR_EFF_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.EFF */
#define IFX_CAN_TTSR_EFF_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.EFF */
#define IFX_CAN_TTSR_EFF_OFF (9)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.EFI */
#define IFX_CAN_TTSR_EFI_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.EFI */
#define IFX_CAN_TTSR_EFI_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.EFI */
#define IFX_CAN_TTSR_EFI_OFF (8)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.ERRS */
#define IFX_CAN_TTSR_ERRS_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.ERRS */
#define IFX_CAN_TTSR_ERRS_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.ERRS */
#define IFX_CAN_TTSR_ERRS_OFF (0)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.ETR */
#define IFX_CAN_TTSR_ETR_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.ETR */
#define IFX_CAN_TTSR_ETR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.ETR */
#define IFX_CAN_TTSR_ETR_OFF (25)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.ETREV */
#define IFX_CAN_TTSR_ETREV_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.ETREV */
#define IFX_CAN_TTSR_ETREV_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.ETREV */
#define IFX_CAN_TTSR_ETREV_OFF (26)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.MSCMAX */
#define IFX_CAN_TTSR_MSCMAX_LEN (3)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.MSCMAX */
#define IFX_CAN_TTSR_MSCMAX_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.MSCMAX */
#define IFX_CAN_TTSR_MSCMAX_OFF (20)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.MSCMIN */
#define IFX_CAN_TTSR_MSCMIN_LEN (3)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.MSCMIN */
#define IFX_CAN_TTSR_MSCMIN_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.MSCMIN */
#define IFX_CAN_TTSR_MSCMIN_OFF (16)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.MSR */
#define IFX_CAN_TTSR_MSR_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.MSR */
#define IFX_CAN_TTSR_MSR_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.MSR */
#define IFX_CAN_TTSR_MSR_OFF (2)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.NIG */
#define IFX_CAN_TTSR_NIG_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.NIG */
#define IFX_CAN_TTSR_NIG_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.NIG */
#define IFX_CAN_TTSR_NIG_OFF (24)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.RECF */
#define IFX_CAN_TTSR_RECF_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.RECF */
#define IFX_CAN_TTSR_RECF_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.RECF */
#define IFX_CAN_TTSR_RECF_OFF (15)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.REFTRG */
#define IFX_CAN_TTSR_REFTRG_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.REFTRG */
#define IFX_CAN_TTSR_REFTRG_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.REFTRG */
#define IFX_CAN_TTSR_REFTRG_OFF (10)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.SYNCS */
#define IFX_CAN_TTSR_SYNCS_LEN (2)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.SYNCS */
#define IFX_CAN_TTSR_SYNCS_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.SYNCS */
#define IFX_CAN_TTSR_SYNCS_OFF (4)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.TMPC */
#define IFX_CAN_TTSR_TMPC_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.TMPC */
#define IFX_CAN_TTSR_TMPC_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TTSR_Bits.TMPC */
#define IFX_CAN_TTSR_TMPC_OFF (13)

/** \\brief  Length for Ifx_CAN_TTSR_Bits.TRAF */
#define IFX_CAN_TTSR_TRAF_LEN (1)

/** \\brief  Mask for Ifx_CAN_TTSR_Bits.TRAF */
#define IFX_CAN_TTSR_TRAF_MSK (0x1)

