HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_bf.h
/** \\brief  Offset for Ifx_CAN_TTSR_Bits.TRAF */
#define IFX_CAN_TTSR_TRAF_OFF (14)

/** \\brief  Length for Ifx_CAN_TURR_Bits.ADJEN */
#define IFX_CAN_TURR_ADJEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.ADJEN */
#define IFX_CAN_TURR_ADJEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.ADJEN */
#define IFX_CAN_TURR_ADJEN_OFF (0)

/** \\brief  Length for Ifx_CAN_TURR_Bits.LTCS */
#define IFX_CAN_TURR_LTCS_LEN (1)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.LTCS */
#define IFX_CAN_TURR_LTCS_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.LTCS */
#define IFX_CAN_TURR_LTCS_OFF (17)

/** \\brief  Length for Ifx_CAN_TURR_Bits.LTDIV */
#define IFX_CAN_TURR_LTDIV_LEN (3)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.LTDIV */
#define IFX_CAN_TURR_LTDIV_MSK (0x7)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.LTDIV */
#define IFX_CAN_TURR_LTDIV_OFF (18)

/** \\brief  Length for Ifx_CAN_TURR_Bits.TUR */
#define IFX_CAN_TURR_TUR_LEN (10)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.TUR */
#define IFX_CAN_TURR_TUR_MSK (0x3ff)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.TUR */
#define IFX_CAN_TURR_TUR_OFF (22)

/** \\brief  Length for Ifx_CAN_TURR_Bits.TURADJ */
#define IFX_CAN_TURR_TURADJ_LEN (10)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.TURADJ */
#define IFX_CAN_TURR_TURADJ_MSK (0x3ff)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.TURADJ */
#define IFX_CAN_TURR_TURADJ_OFF (6)

/** \\brief  Length for Ifx_CAN_TURR_Bits.VAL */
#define IFX_CAN_TURR_VAL_LEN (1)

/** \\brief  Mask for Ifx_CAN_TURR_Bits.VAL */
#define IFX_CAN_TURR_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_TURR_Bits.VAL */
#define IFX_CAN_TURR_VAL_OFF (16)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_BF_H */
